In [2]:
import pandas as pd

In [3]:
series=pd.Series([12,1.5,"RAHUL"])
series

0       12
1      1.5
2    RAHUL
dtype: object

In [4]:
series=pd.Series([12,1.5,"RAHUL"],index=["roll no","int","name"])
series

roll no       12
int          1.5
name       RAHUL
dtype: object

In [5]:
series["roll no"]

12

In [6]:
series.index

Index(['roll no', 'int', 'name'], dtype='object')

In [7]:
series.keys()

Index(['roll no', 'int', 'name'], dtype='object')

In [8]:
type(series.keys())

pandas.core.indexes.base.Index

In [9]:
type(series.index)

pandas.core.indexes.base.Index

In [10]:
series[0]

12

In [11]:
series.index.name="info"
series.name="details"

In [12]:
series

info
roll no       12
int          1.5
name       RAHUL
Name: details, dtype: object

In [13]:
dict={"rahul":1,"shivam":2,"trishar":3}
pd.Series(dict)

rahul      1
shivam     2
trishar    3
dtype: int64

In [14]:
dict2=pd.Series(dict,index=["shivam","rahul","trishar","raman"])
dict2

shivam     2.0
rahul      1.0
trishar    3.0
raman      NaN
dtype: float64

In [15]:
dict2.isnull()

shivam     False
rahul      False
trishar    False
raman       True
dtype: bool

In [16]:
dict2.notnull()

shivam      True
rahul       True
trishar     True
raman      False
dtype: bool

In [17]:
~dict2.notnull()

shivam     False
rahul      False
trishar    False
raman       True
dtype: bool

In [18]:
data1=pd.DataFrame({"Name":["Rahul","shivam","mayank","nikhil","hemant","puranjay","akshay"],"Subject":["arts","commerce","science","vocational","economics","arts","commerce"]})
data1

       Name     Subject
0     Rahul        arts
1    shivam    commerce
2    mayank     science
3    nikhil  vocational
4    hemant   economics
5  puranjay        arts
6    akshay    commerce

In [19]:

data  =  pd.DataFrame({'value':[632, 1638, 569, 115, 433, 1130, 754, 555],
                     'patient':[1, 1, 1, 1, 2, 2, 2, 2],
                     'phylum':['Firmicutes', 'Proteobacteria', 'Actinobacteria', 
    'Bacteroidetes', 'Firmicutes', 'Proteobacteria', 'Actinobacteria', 'Bacteroidetes']})
data

   value  patient          phylum
0    632        1      Firmicutes
1   1638        1  Proteobacteria
2    569        1  Actinobacteria
3    115        1   Bacteroidetes
4    433        2      Firmicutes
5   1130        2  Proteobacteria
6    754        2  Actinobacteria
7    555        2   Bacteroidetes

In [20]:
data1[["Name",]]

       Name
0     Rahul
1    shivam
2    mayank
3    nikhil
4    hemant
5  puranjay
6    akshay

In [21]:
data1[["Subject"]]

      Subject
0        arts
1    commerce
2     science
3  vocational
4   economics
5        arts
6    commerce

In [22]:
data1.values

array([['Rahul', 'arts'],
       ['shivam', 'commerce'],
       ['mayank', 'science'],
       ['nikhil', 'vocational'],
       ['hemant', 'economics'],
       ['puranjay', 'arts'],
       ['akshay', 'commerce']], dtype=object)

In [23]:
data1.columns

Index(['Name', 'Subject'], dtype='object')

In [24]:
print(data1)
data1.iloc[2]

       Name     Subject
0     Rahul        arts
1    shivam    commerce
2    mayank     science
3    nikhil  vocational
4    hemant   economics
5  puranjay        arts
6    akshay    commerce

Name        mayank
Subject    science
Name: 2, dtype: object

In [25]:
print(data1)
data1.loc[2]

       Name     Subject
0     Rahul        arts
1    shivam    commerce
2    mayank     science
3    nikhil  vocational
4    hemant   economics
5  puranjay        arts
6    akshay    commerce

Name        mayank
Subject    science
Name: 2, dtype: object

In [26]:
data1

       Name     Subject
0     Rahul        arts
1    shivam    commerce
2    mayank     science
3    nikhil  vocational
4    hemant   economics
5  puranjay        arts
6    akshay    commerce

In [27]:
data1["Subject"][2]="Vocational"
data1.Subject

0          arts
1      commerce
2    Vocational
3    vocational
4     economics
5          arts
6      commerce
Name: Subject, dtype: object

In [28]:
data1

       Name     Subject
0     Rahul        arts
1    shivam    commerce
2    mayank  Vocational
3    nikhil  vocational
4    hemant   economics
5  puranjay        arts
6    akshay    commerce

In [29]:
data1[2:3]

     Name     Subject
2  mayank  Vocational

In [32]:
data1[["Name"]][2:3]

     Name
2  mayank